r5-c_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 15301.93 qps: 153027.80 (r/w/o: 153027.80/0.00/0.00) lat (ms,95%): 3.30 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 16761.54 qps: 167614.44 (r/w/o: 167614.44/0.00/0.00) lat (ms,95%): 2.76 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 18360.46 qps: 183603.54 (r/w/o: 183603.54/0.00/0.00) lat (ms,95%): 2.35 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 18497.25 qps: 184973.61 (r/w/o: 184973.61/0.00/0.00) lat (ms,95%): 2.26 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 19093.25 qps: 190932.04 (r/w/o: 190932.04/0.00/0.00) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 18848.56 qps: 188487.08 (r/w/o: 188487.08/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 19577.49 qps: 195773.57 (r/w/o: 195773.57/0.00/0.00) lat (ms,95%): 2.00 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 19363.63 qps: 193636.73 (r/w/o: 193636.73/0.00/0.00) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 18964.43 qps: 189643.96 (r/w/o: 189643.96/0.00/0.00) lat (ms,95%): 2.11 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 18633.76 qps: 186337.63 (r/w/o: 186337.63/0.00/0.00) lat (ms,95%): 2.18 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 19291.17 qps: 192913.00 (r/w/o: 192913.00/0.00/0.00) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 18905.73 qps: 189056.41 (r/w/o: 189056.41/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 18296.83 qps: 182969.20 (r/w/o: 182969.20/0.00/0.00) lat (ms,95%): 2.22 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 19623.23 qps: 196230.36 (r/w/o: 196230.36/0.00/0.00) lat (ms,95%): 2.00 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 20097.94 qps: 200980.41 (r/w/o: 200980.41/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 19933.86 qps: 199337.11 (r/w/o: 199337.11/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 19882.98 qps: 198830.26 (r/w/o: 198830.26/0.00/0.00) lat (ms,95%): 1.96 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 19663.90 qps: 196639.00 (r/w/o: 196639.00/0.00/0.00) lat (ms,95%): 1.96 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 19166.16 qps: 191661.74 (r/w/o: 191661.74/0.00/0.00) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 19407.01 qps: 194070.08 (r/w/o: 194070.08/0.00/0.00) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 20101.10 qps: 201012.21 (r/w/o: 201012.21/0.00/0.00) lat (ms,95%): 1.89 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 19997.95 qps: 199979.94 (r/w/o: 199979.94/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 19948.45 qps: 199482.76 (r/w/o: 199482.76/0.00/0.00) lat (ms,95%): 1.93 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 19282.04 qps: 192819.60 (r/w/o: 192819.60/0.00/0.00) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 18733.90 qps: 187341.32 (r/w/o: 187341.32/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 19303.39 qps: 193032.26 (r/w/o: 193032.26/0.00/0.00) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 19302.06 qps: 193021.87 (r/w/o: 193021.87/0.00/0.00) lat (ms,95%): 2.03 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 19427.69 qps: 194275.15 (r/w/o: 194275.15/0.00/0.00) lat (ms,95%): 2.00 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 19133.91 qps: 191340.02 (r/w/o: 191340.02/0.00/0.00) lat (ms,95%): 2.07 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 18738.56 qps: 187385.64 (r/w/o: 187385.64/0.00/0.00) lat (ms,95%): 2.14 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            114328620
        write:                           0
        other:                           0
        total:                           114328620
    transactions:                        11432862 (19054.35 per sec.)
    queries:                             114328620 (190543.50 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0119s
    total number of events:              11432862

Latency (ms):
         min:                                    1.09
         avg:                                    1.68
         max:                                  414.66
         95th percentile:                        2.11
         sum:                             19182075.13

Threads fairness:
    events (avg/stddev):           357276.9375/3621.90
    execution time (avg/stddev):   599.4398/0.02