r5-c_rw.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 64
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 64 tps: 2210.81 qps: 44254.92 (r/w/o: 30984.34/8845.35/4425.23) lat (ms,95%): 34.95 err/s: 0.40 reconn/s: 0.00
[ 40s ] thds: 64 tps: 2313.00 qps: 46256.68 (r/w/o: 32379.50/9250.82/4626.36) lat (ms,95%): 31.94 err/s: 0.35 reconn/s: 0.00
[ 60s ] thds: 64 tps: 2344.94 qps: 46900.80 (r/w/o: 32830.45/9380.67/4689.69) lat (ms,95%): 31.37 err/s: 0.55 reconn/s: 0.00
[ 80s ] thds: 64 tps: 2340.19 qps: 46854.07 (r/w/o: 32798.96/9373.62/4681.49) lat (ms,95%): 31.37 err/s: 0.35 reconn/s: 0.00
[ 100s ] thds: 64 tps: 2341.03 qps: 46810.00 (r/w/o: 32771.02/9356.47/4682.51) lat (ms,95%): 31.37 err/s: 0.45 reconn/s: 0.00
[ 120s ] thds: 64 tps: 2410.19 qps: 48185.07 (r/w/o: 33725.11/9639.12/4820.84) lat (ms,95%): 29.72 err/s: 0.55 reconn/s: 0.00
[ 140s ] thds: 64 tps: 2355.02 qps: 47137.96 (r/w/o: 33006.28/9420.88/4710.79) lat (ms,95%): 31.37 err/s: 0.65 reconn/s: 0.00
[ 160s ] thds: 64 tps: 2382.28 qps: 47644.43 (r/w/o: 33351.08/9527.99/4765.37) lat (ms,95%): 31.37 err/s: 0.80 reconn/s: 0.00
[ 180s ] thds: 64 tps: 2395.39 qps: 47948.62 (r/w/o: 33562.61/9594.74/4791.27) lat (ms,95%): 30.26 err/s: 0.50 reconn/s: 0.00
[ 200s ] thds: 64 tps: 2410.23 qps: 48196.36 (r/w/o: 33746.28/9628.92/4821.16) lat (ms,95%): 30.81 err/s: 0.70 reconn/s: 0.00
[ 220s ] thds: 64 tps: 2419.20 qps: 48416.60 (r/w/o: 33887.73/9689.56/4839.30) lat (ms,95%): 30.26 err/s: 0.90 reconn/s: 0.00
[ 240s ] thds: 64 tps: 2458.64 qps: 49150.60 (r/w/o: 34407.86/9825.01/4917.73) lat (ms,95%): 29.72 err/s: 0.45 reconn/s: 0.00
[ 260s ] thds: 64 tps: 2418.90 qps: 48398.68 (r/w/o: 33883.19/9677.30/4838.20) lat (ms,95%): 30.26 err/s: 0.50 reconn/s: 0.00
[ 280s ] thds: 64 tps: 2451.56 qps: 49060.14 (r/w/o: 34338.52/9817.80/4903.82) lat (ms,95%): 29.72 err/s: 0.60 reconn/s: 0.00
[ 300s ] thds: 64 tps: 2507.00 qps: 50155.50 (r/w/o: 35111.30/10029.25/5014.95) lat (ms,95%): 28.67 err/s: 0.95 reconn/s: 0.00
[ 320s ] thds: 64 tps: 2433.70 qps: 48682.08 (r/w/o: 34079.52/9734.61/4867.95) lat (ms,95%): 30.26 err/s: 0.55 reconn/s: 0.00
[ 340s ] thds: 64 tps: 2486.21 qps: 49684.35 (r/w/o: 34777.67/9933.85/4972.82) lat (ms,95%): 29.19 err/s: 0.50 reconn/s: 0.00
[ 360s ] thds: 64 tps: 2472.58 qps: 49510.54 (r/w/o: 34660.88/9903.79/4945.87) lat (ms,95%): 29.19 err/s: 0.60 reconn/s: 0.00
[ 380s ] thds: 64 tps: 2449.60 qps: 48998.56 (r/w/o: 34301.14/9797.73/4899.69) lat (ms,95%): 30.26 err/s: 0.50 reconn/s: 0.00
[ 400s ] thds: 64 tps: 2460.24 qps: 49186.10 (r/w/o: 34435.65/9829.87/4920.59) lat (ms,95%): 29.72 err/s: 0.30 reconn/s: 0.00
[ 420s ] thds: 64 tps: 2503.92 qps: 50100.00 (r/w/o: 35069.90/10021.47/5008.64) lat (ms,95%): 28.67 err/s: 0.60 reconn/s: 0.00
[ 440s ] thds: 64 tps: 2478.95 qps: 49554.68 (r/w/o: 34683.12/9912.91/4958.65) lat (ms,95%): 29.72 err/s: 0.95 reconn/s: 0.00
[ 460s ] thds: 64 tps: 2521.19 qps: 50434.56 (r/w/o: 35305.89/10085.30/5043.38) lat (ms,95%): 29.72 err/s: 0.85 reconn/s: 0.00
[ 480s ] thds: 64 tps: 2521.84 qps: 50499.15 (r/w/o: 35356.94/10097.92/5044.28) lat (ms,95%): 29.19 err/s: 0.55 reconn/s: 0.00
[ 500s ] thds: 64 tps: 2499.23 qps: 49976.93 (r/w/o: 34989.87/9988.09/4998.97) lat (ms,95%): 29.72 err/s: 0.50 reconn/s: 0.00
[ 520s ] thds: 64 tps: 2518.46 qps: 50357.72 (r/w/o: 35243.82/10076.33/5037.57) lat (ms,95%): 28.67 err/s: 0.70 reconn/s: 0.00
[ 540s ] thds: 64 tps: 2561.07 qps: 51267.15 (r/w/o: 35890.95/10253.62/5122.58) lat (ms,95%): 28.67 err/s: 0.40 reconn/s: 0.00
[ 560s ] thds: 64 tps: 2526.35 qps: 50512.19 (r/w/o: 35363.66/10095.27/5053.26) lat (ms,95%): 29.72 err/s: 0.55 reconn/s: 0.00
[ 580s ] thds: 64 tps: 2526.60 qps: 50517.98 (r/w/o: 35356.95/10107.39/5053.64) lat (ms,95%): 29.19 err/s: 0.60 reconn/s: 0.00
[ 600s ] thds: 64 tps: 2550.64 qps: 51065.23 (r/w/o: 35752.13/10211.22/5101.88) lat (ms,95%): 28.67 err/s: 0.45 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            20521102
        write:                           5862248
        other:                           2931240
        total:                           29314590
    transactions:                        1465447 (2441.87 per sec.)
    queries:                             29314590 (48846.77 per sec.)
    ignored errors:                      346    (0.58 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.1324s
    total number of events:              1465447

Latency (ms):
         min:                                    6.11
         avg:                                   26.20
         max:                                  110.12
         95th percentile:                       30.26
         sum:                             38399111.11

Threads fairness:
    events (avg/stddev):           22897.6094/21.13
    execution time (avg/stddev):   599.9861/0.02