r6g-a_read.log
WARNING: --max-time is deprecated, use --time instead
sysbench 1.0.20 (using bundled LuaJIT 2.1.0-beta2)

Running the test with following options:
Number of threads: 32
Report intermediate results every 20 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 20s ] thds: 32 tps: 16342.16 qps: 163429.55 (r/w/o: 163429.55/0.00/0.00) lat (ms,95%): 2.91 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 32 tps: 17627.41 qps: 176275.01 (r/w/o: 176275.01/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 32 tps: 18333.22 qps: 183331.41 (r/w/o: 183331.41/0.00/0.00) lat (ms,95%): 2.71 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 32 tps: 18647.50 qps: 186474.26 (r/w/o: 186474.26/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 32 tps: 19246.01 qps: 192458.27 (r/w/o: 192458.27/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 120s ] thds: 32 tps: 19319.49 qps: 193198.14 (r/w/o: 193198.14/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 140s ] thds: 32 tps: 19283.29 qps: 192830.95 (r/w/o: 192830.95/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 160s ] thds: 32 tps: 19325.02 qps: 193251.44 (r/w/o: 193251.44/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 180s ] thds: 32 tps: 19241.09 qps: 192410.41 (r/w/o: 192410.41/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 200s ] thds: 32 tps: 19304.99 qps: 193048.75 (r/w/o: 193048.75/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 220s ] thds: 32 tps: 19317.20 qps: 193172.36 (r/w/o: 193172.36/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 240s ] thds: 32 tps: 19257.27 qps: 192571.80 (r/w/o: 192571.80/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 260s ] thds: 32 tps: 19263.11 qps: 192632.53 (r/w/o: 192632.53/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 280s ] thds: 32 tps: 19353.85 qps: 193540.00 (r/w/o: 193540.00/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 300s ] thds: 32 tps: 19276.48 qps: 192762.92 (r/w/o: 192762.92/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 320s ] thds: 32 tps: 19301.65 qps: 193017.41 (r/w/o: 193017.41/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 340s ] thds: 32 tps: 19375.73 qps: 193757.41 (r/w/o: 193757.41/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 360s ] thds: 32 tps: 19264.75 qps: 192648.68 (r/w/o: 192648.68/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 380s ] thds: 32 tps: 19331.05 qps: 193308.54 (r/w/o: 193308.54/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 400s ] thds: 32 tps: 19295.41 qps: 192956.03 (r/w/o: 192956.03/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 420s ] thds: 32 tps: 19300.59 qps: 193003.17 (r/w/o: 193003.17/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 440s ] thds: 32 tps: 19331.35 qps: 193313.89 (r/w/o: 193313.89/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 460s ] thds: 32 tps: 19344.70 qps: 193447.06 (r/w/o: 193447.06/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 480s ] thds: 32 tps: 19268.34 qps: 192683.68 (r/w/o: 192683.68/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 500s ] thds: 32 tps: 19343.73 qps: 193436.51 (r/w/o: 193436.51/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 520s ] thds: 32 tps: 19324.55 qps: 193244.15 (r/w/o: 193244.15/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 540s ] thds: 32 tps: 19285.82 qps: 192860.64 (r/w/o: 192860.64/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 560s ] thds: 32 tps: 19339.89 qps: 193398.68 (r/w/o: 193398.68/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 580s ] thds: 32 tps: 19370.96 qps: 193710.20 (r/w/o: 193710.20/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
[ 600s ] thds: 32 tps: 19251.36 qps: 192513.62 (r/w/o: 192513.62/0.00/0.00) lat (ms,95%): 2.66 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            114574170
        write:                           0
        other:                           0
        total:                           114574170
    transactions:                        11457417 (19095.30 per sec.)
    queries:                             114574170 (190953.01 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          600.0112s
    total number of events:              11457417

Latency (ms):
         min:                                    1.00
         avg:                                    1.67
         max:                                  247.27
         95th percentile:                        2.66
         sum:                             19182603.14

Threads fairness:
    events (avg/stddev):           358044.2812/59728.99
    execution time (avg/stddev):   599.4563/0.09